Catalogs/РегламентныеИнтервалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РегламентныеИнтервалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныПроцессов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНачальногоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонечногоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗависитОтВремениНачала</Name>
					<Comment>Ложь - не зависит (указывается один срок), Истина - зависит (указывается два срока)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказанияВремениОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасыПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияДниПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказанияВремениОкончанияПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОбъектАдресацииКуратора</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресацииКуратора</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадачКуратора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполненияЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредшественникиЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПоследователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПредшественника</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДействующиеРегламентныеИнтервалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДействующиеРегламентныеИнтервалы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегламентныйИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеИнтервалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНачальногоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РегламентныеИнтервалы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриСозданииНаСервереФормыРегламентногоИнтервала(ЭтотОбъект, Отказ);
	
	КураторПредставление = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(
		Объект.Куратор,
		Объект.ОсновнойОбъектАдресацииКуратора,
		Объект.ДополнительныйОбъектАдресацииКуратора);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовкаФормыПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИдентификаторПоддержкиСтрокой = Объект.ИдентификаторПоддержки;
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриЧтенииНаСервереФормыРегламентногоИнтервала(ЭтотОбъект, ТекущийОбъект);
	
	ПодготовкаФормыПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьАвтоНаименование();
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = АвтоНаименование;
	КонецЕсли;
	
	ОбновитьПредставлениеСрокаИнтервала();
	
	РазвернутьДеревоЭтапов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьЗаполненностьСрокаВыполнения(Отказ);
	
	ПроверитьЗаполненностьНормативовВДеревеЭтапов(ДеревоЭтапов, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой)
		И ИдентификаторПоддержкиСтрокой <> Строка(ТекущийОбъект.ИдентификаторПоддержки) Тогда
		ТекущийОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ОсновнойОбъектАдресацииКуратора) Тогда
		ТекущийОбъект.ОсновнойОбъектАдресацииКуратора = Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ДополнительныйОбъектАдресацииКуратора) Тогда
		ТекущийОбъект.ДополнительныйОбъектАдресацииКуратора = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПредставлениеЭтапов();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой) Тогда
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Введен некорректный уникальный идентификатор'"),,
				"ИдентификаторПоддержкиСтрокой",, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокИнтервалаПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСрока = Новый Структура("СрокЗависитОтВремениНачала, ВремяНачала, СрокВыполненияЧасы, СрокВыполненияДни, СпособУказанияВремениОкончания,
		|ВремяОкончания, СрокВыполненияЧасыПосле, СрокВыполненияДниПосле, СпособУказанияВремениОкончанияПосле, ВремяОкончанияПосле");
	ЗаполнитьЗначенияСвойств(ПараметрыСрока, Объект);
	
	ПараметрыСрока.Вставить("НаименованиеРегламентногоИнтервала", Объект.Наименование);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеНастройкиСрокаВыполнения", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.РегламентныеИнтервалы.Форма.НастройкаСрокаВыполнения", ПараметрыСрока, ЭтотОбъект, , , , ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройкиСрокаВыполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ЗаполнитьЗначенияСвойств(Объект, Результат);
	
	ОбновитьПредставлениеСрокаИнтервала();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНачальногоЭтапаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Выбор начального этапа регламентного интервала'"));
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Шаблон", Объект.Владелец);
	ПараметрыФормы.Вставить("ИдентификаторЭтапа", Объект.ИдентификаторНачальногоЭтапа);
	
	ОткрытьФорму("ОбщаяФорма.ВыборЭтапаПроцесса", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеКонечногоЭтапаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ПредставлениеНачальногоЭтапа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите начальный этап'"),,"ПредставлениеНачальногоЭтапа");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Выбор конечного этапа регламентного интервала'"));
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Шаблон", Объект.Владелец);
	ПараметрыФормы.Вставить("ИдентификаторЭтапа", Объект.ИдентификаторКонечногоЭтапа);
	ПараметрыФормы.Вставить("ОграничитьСпискокЭтапов", Истина);
	ПараметрыФормы.Вставить("ДоступныеЭтапы", ДоступныеКонечныеЭтапы(Объект.Владелец, Объект.ИдентификаторНачальногоЭтапа));
	
	ОткрытьФорму("ОбщаяФорма.ВыборЭтапаПроцесса", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНачальногоЭтапаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Объект.ИдентификаторНачальногоЭтапа = ВыбранноеЗначение.ИдентификаторЭтапа;
		ВыбранноеЗначение = Строка(ВыбранноеЗначение.НомерЭтапа)+". "+ВыбранноеЗначение.Этап;
	КонецЕсли;
	
	ЗаполнитьТаблицуЭтапов();
	
	РазвернутьДеревоЭтапов();
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеКонечногоЭтапаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Объект.ИдентификаторКонечногоЭтапа = ВыбранноеЗначение.ИдентификаторЭтапа;
		ВыбранноеЗначение = Строка(ВыбранноеЗначение.НомерЭтапа)+". "+ВыбранноеЗначение.Этап;
	КонецЕсли;
	
	ЗаполнитьТаблицуЭтапов();
	
	РазвернутьДеревоЭтапов();
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНачальногоЭтапаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткеНачальногоЭтапа", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Список этапов будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткеНачальногоЭтапа(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ПредставлениеНачальногоЭтапа = "";
	Объект.ИдентификаторНачальногоЭтапа = "";
	
	Объект.Этапы.Очистить();
	ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	
	СуммарныйНорматив = 0;
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеКонечногоЭтапаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткеКонечногоЭтапа", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Список этапов будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткеКонечногоЭтапа(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ПредставлениеКонечногоЭтапа = "";
	Объект.ИдентификаторКонечногоЭтапа = "";
	
	Объект.Этапы.Очистить();
	ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	
	СуммарныйНорматив = 0;
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура КураторПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроцессыОбработкиДокументовКлиент.ВыбратьИсполнителя(Элемент, Объект.Куратор, , Ложь, "Выбор куратора интервала");
	
КонецПроцедуры

&НаКлиенте
Процедура КураторПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Объект.Куратор = ВыбранноеЗначение.РольИсполнителя;
		Объект.ОсновнойОбъектАдресацииКуратора = ВыбранноеЗначение.ОсновнойОбъектАдресации;
		Объект.ДополнительныйОбъектАдресацииКуратора = ВыбранноеЗначение.ДополнительныйОбъектАдресации;
	Иначе
		Объект.Куратор = ВыбранноеЗначение;
		Объект.ОсновнойОбъектАдресацииКуратора = "";
		Объект.ДополнительныйОбъектАдресацииКуратора = "";
	КонецЕсли;
	
	ВыбранноеЗначение = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(Объект.Куратор,
																								Объект.ОсновнойОбъектАдресацииКуратора,
																								Объект.ДополнительныйОбъектАдресацииКуратора);
	
КонецПроцедуры

&НаКлиенте
Процедура КураторПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Объект.Куратор);
КонецПроцедуры

&НаКлиенте
Процедура КураторПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Объект.Куратор = "";
	Объект.ОсновнойОбъектАдресацииКуратора = "";
	Объект.ДополнительныйОбъектАдресацииКуратора = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДеревоЭтапов

&НаКлиенте
Процедура ДеревоЭтаповСрокВыполненияЧасыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ДеревоЭтапов.ТекущиеДанные;
	
	Для Каждого СтрокаЭтап Из Объект.Этапы Цикл
		Если СтрокаЭтап.ИдентификаторЭтапа = ТекущиеДанные.ИдентификаторЭтапа Тогда
			СтрокаЭтап.СрокВыполненияЧасы = ТекущиеДанные.СрокВыполненияЧасы;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьСрокиВГруппахЭтаповДерева();
	
	ОбновитьКэшСрокаЭтапа(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовкаФормыПриЧтенииСозданииНаСервере()
	
	ЗначениеВРеквизитФормы(ТаблицаЭтаповШаблона(Объект.Владелец), "ЭтапыШаблона");
	
	ПроверитьИОбновитьСвойстваЭтапов();
	
	ОбновитьДеревоЭтаповПоДаннымОбъекта();
	
	ОбновитьПредставлениеЭтапов();
	
	ОбновитьИнформациюОВводеВДействие();
	
	ОбновитьКэшСроковЭтаповПоДаннымОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьАвтоНаименование()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторНачальногоЭтапа)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ИдентификаторКонечногоЭтапа) Тогда
		СтрокаНаименование = "";
	ИначеЕсли Объект.ИдентификаторНачальногоЭтапа = Объект.ИдентификаторКонечногоЭтапа Тогда
		СвойстваЭтапа = ЭтапыШаблона.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", Объект.ИдентификаторНачальногоЭтапа))[0];
		СтрокаНаименование = Строка(СвойстваЭтапа.Этап);
	Иначе
		СвойстваЭтапа = ЭтапыШаблона.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", Объект.ИдентификаторНачальногоЭтапа))[0];
		СтрокаНаименование = Строка(СвойстваЭтапа.Этап);
		СвойстваЭтапа = ЭтапыШаблона.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", Объект.ИдентификаторКонечногоЭтапа))[0];
		СтрокаНаименование = СтрокаНаименование + " - " + Строка(СвойстваЭтапа.Этап);
	КонецЕсли;
	
	Если НЕ СтрокаНаименование = "" Тогда
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименование);
	КонецЕсли;
	
	АвтоНаименование = СтрокаНаименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование()
	
	ИспользуетсяАвтоНаименование = Объект.Наименование = АвтоНаименование;
	
	СформироватьАвтоНаименование();
	
	Если ИспользуетсяАвтоНаименование Тогда
		Объект.Наименование = АвтоНаименование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИОбновитьСвойстваЭтапов()
	
	Для Каждого Этап Из Объект.Этапы Цикл
		
		СвойстваЭтапа = ЭтапыШаблона.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа));
		
		Если СвойстваЭтапа.Количество() = 0 Тогда
			Этап.НеСоответствуетЭтапуШаблонаПроцесса = Истина;
			Продолжить;
		КонецЕсли;
		
		Этап.ПредставлениеЭтапа = СвойстваЭтапа[0].ПредставлениеЭтапа;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеЭтапов()
	
	ЗаполнитьПредставлениеЭтапа(ПредставлениеНачальногоЭтапа, Объект.ИдентификаторНачальногоЭтапа);
	ЗаполнитьПредставлениеЭтапа(ПредставлениеКонечногоЭтапа, Объект.ИдентификаторКонечногоЭтапа);
	
	Для Каждого Этап Из Объект.Этапы Цикл
		ЗаполнитьПредставлениеЭтапа(Этап.ПредставлениеЭтапа, Этап.ИдентификаторЭтапа);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеСрокаИнтервала()
	
	СрокИнтервалаПредставление = ПроцессыОбработкиДокументовКлиент.ПредставлениеСрокаВыполненияИнтервала(Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеКонечныеЭтапы(Шаблон, НачальныйЭтап)
	
	ТаблицаПредшественников = ТаблицаПредшественниковШаблона(Шаблон);
	
	Результат = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НачальныйЭтап);
	ДобавитьПоследователейЭтапа(ТаблицаПредшественников, Результат, НачальныйЭтап);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьПоследователейЭтапа(ТаблицаПредшественников, Результат, Этап)
	Последователи = ТаблицаПредшественников.НайтиСтроки(Новый Структура("ИдентификаторПредшественника", Этап));
	Для Каждого Последователь Из Последователи Цикл
		Если Результат.Найти(Последователь.ИдентификаторПоследователя) = Неопределено Тогда
			Результат.Добавить(Последователь.ИдентификаторПоследователя);
			ДобавитьПоследователейЭтапа(ТаблицаПредшественников, Результат, Последователь.ИдентификаторПоследователя);
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаЭтаповШаблона(Шаблон)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессовЭтапы.НомерСтроки КАК НомерСтроки,
	|	ШаблоныПроцессовЭтапы.ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|	ШаблоныПроцессовЭтапы.Этап КАК Этап,
	|	ШаблоныПроцессовЭтапы.СрокВыполненияЧасы КАК СрокВыполненияЧасы,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА (100)) КАК ПредставлениеЭтапа
	|ИЗ
	|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|ГДЕ
	|	ШаблоныПроцессовЭтапы.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРезультата Из Результат Цикл
		СтрокаРезультата.ПредставлениеЭтапа = Строка(СтрокаРезультата.НомерСтроки)+". "+СтрокаРезультата.Этап;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаПредшественниковШаблона(Шаблон)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессовПредшественникиЭтапов.ИдентификаторПоследователя КАК ИдентификаторПоследователя,
	|	ШаблоныПроцессовПредшественникиЭтапов.ИдентификаторПредшественника КАК ИдентификаторПредшественника
	|ИЗ
	|	Справочник.ШаблоныПроцессов.ПредшественникиЭтапов КАК ШаблоныПроцессовПредшественникиЭтапов
	|ГДЕ
	|	ШаблоныПроцессовПредшественникиЭтапов.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуЭтапов()
	
	Объект.Этапы.Очистить();
	
	ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторНачальногоЭтапа)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ИдентификаторКонечногоЭтапа) Тогда
		Возврат;
	КонецЕсли;
	
	Маршруты = ПроцессыОбработкиДокументов.МаршрутыШаблонаОтНачальногоЭтапаДоКонечного(
		ТаблицаПредшественниковШаблона(Объект.Владелец), Объект.ИдентификаторНачальногоЭтапа, Объект.ИдентификаторКонечногоЭтапа);
	
	Если Маршруты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось проложить маршрут от начального этапа до конечного.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ МаршрутыМожноОтсортировать(Маршруты) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Множество маршрутов от начального этапа до конечного невозможно отобразить в виде одной последовательности,
				|так как некоторые этапы одного маршрута имеют обратный порядок следования в другом маршруте'"));
		Возврат;
	КонецЕсли;
	
	// Заполнение плоской таблицы
	ЗаполнитьЭтапыИнтервала(Маршруты);
	
	// Заполнение таблицы предшественников по маршрутам
	Объект.ПредшественникиЭтапов.Загрузить(ПроцессыОбработкиДокументов.ТаблицаПредшественниковПоМаршрутам(Маршруты));
	
	//Заполнение дерева этапов с учетом параллельности
	ПроцессыОбработкиДокументов.ЗаполнитьДеревоЭтапов(ДеревоЭтапов, Объект.Этапы, Маршруты);
	
	Если Не ДеревоЭтаповКорректно() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось построить дерево этапов интервала.'"));
		Объект.Этапы.Очистить();
		ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	КонецЕсли;
	
	РассчитатьСрокиВГруппахЭтаповДерева();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоЭтаповПоДаннымОбъекта()
	
	ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторНачальногоЭтапа)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ИдентификаторКонечногоЭтапа) Тогда
		Возврат;
	КонецЕсли;
	
	Маршруты = ПроцессыОбработкиДокументов.МаршрутыШаблонаОтНачальногоЭтапаДоКонечного(
		Объект.ПредшественникиЭтапов, Объект.ИдентификаторНачальногоЭтапа, Объект.ИдентификаторКонечногоЭтапа);
	
	Если Маршруты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось проложить маршрут от начального этапа до конечного.'"));
		Возврат;
	КонецЕсли;
	
	//Заполнение дерева этапов с учетом параллельных
	ПроцессыОбработкиДокументов.ЗаполнитьДеревоЭтапов(ДеревоЭтапов, Объект.Этапы, Маршруты);
	
	РассчитатьСрокиВГруппахЭтаповДерева();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеЭтапа(ПредставлениеЭтапа, ИдентификаторЭтапа)
	
	СвойстваЭтапа = ЭтапыШаблона.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", ИдентификаторЭтапа));
	
	Если СвойстваЭтапа.Количество() = 0 Тогда
		ПредставлениеЭтапа = "";
	Иначе
		ПредставлениеЭтапа = СвойстваЭтапа[0].ПредставлениеЭтапа;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МаршрутыМожноОтсортировать(Маршруты)
	
	Последователи = Новый Соответствие;
	
	Для Каждого Маршрут Из Маршруты Цикл
		Для к = 0 По Маршрут.ВГраница() - 1 Цикл
			Предшественник = Маршрут[к];
			Для л = к + 1 По Маршрут.ВГраница() Цикл
				Последователь = Маршрут[л];
				Если Последователи[Последователь] <> Неопределено
					И Последователи[Последователь][Предшественник] <> Неопределено Тогда
					Возврат Ложь;
				Иначе
					ПоследовательСоответствие = Новый Соответствие;
					ПоследовательСоответствие.Вставить(Последователь, Истина);
					Если Последователи[Предшественник] = Неопределено Тогда
						Последователи.Вставить(Предшественник, ПоследовательСоответствие);
					Иначе
						Последователи[Предшественник].Вставить(ПоследовательСоответствие);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура СортировкаТаблицыЭтаповВСоответствииСМаршрутами(Таблица, Маршруты)
	
	ТребуетсяСортировкаЭтапов = Истина;
	Пока ТребуетсяСортировкаЭтапов Цикл
		ТребуетсяСортировкаЭтапов = Ложь;
		Для Каждого Маршрут Из Маршруты Цикл
			Для Инд = 0 По Маршрут.ВГраница() - 1 Цикл
				СтрокаЭтап1 = Таблица.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", Маршрут[Инд]))[0];
				СтрокаЭтап2 = Таблица.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", Маршрут[Инд + 1]))[0];
				Пока Таблица.Индекс(СтрокаЭтап1) > Таблица.Индекс(СтрокаЭтап2) Цикл
					Таблица.Сдвинуть(Таблица.Индекс(СтрокаЭтап1), -1);
					ТребуетсяСортировкаЭтапов = Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтапыИнтервала(Маршруты)
	
	ЭтапыМаршрутов = Новый Массив;
	Для Каждого Маршрут Из Маршруты Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЭтапыМаршрутов, Маршрут, Истина);
	КонецЦикла;
	
	Для Каждого Этап Из ЭтапыМаршрутов Цикл
		ПроцессыОбработкиДокументов.ЗаполнитьСвойстваЭтапаВСтроке(Объект.Этапы.Добавить(), Этап, ЭтапыШаблона);
	КонецЦикла;
	
	// Если норматив в шаблоне не заполнен, а в регламентном интервале - заполнен, то оставляем норматив из интервала
	Для Каждого СтрокаЭтап Из Объект.Этапы Цикл
		Если СтрокаЭтап.СрокВыполненияЧасы = 0 Тогда
			Для Каждого КэшЭтапа Из КэшСроковЭтапов Цикл
				Если СтрокаЭтап.ИдентификаторЭтапа = КэшЭтапа.ИдентификаторЭтапа Тогда
					СтрокаЭтап.СрокВыполненияЧасы = КэшЭтапа.СрокВыполненияЧасы;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	СортировкаТаблицыЭтаповВСоответствииСМаршрутами(Объект.Этапы, Маршруты);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСрокиВГруппахЭтаповДерева()
	
	СуммарныйНорматив = 0;
	
	Для Каждого ЭлементДерева Из ДеревоЭтапов.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ИдентификаторЭтапа = "Параллельно" Тогда
			РассчитатьСрокПараллельнойГруппыЭтапов(ЭлементДерева);
		ИначеЕсли ЭлементДерева.ИдентификаторЭтапа = "Последовательно" Тогда
			РассчитатьСрокПоследовательнойГруппыЭтапов(ЭлементДерева);
		КонецЕсли;
		СуммарныйНорматив = СуммарныйНорматив + ЭлементДерева.СрокВыполненияЧасы;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСрокПараллельнойГруппыЭтапов(ГруппаЭтапов)
	
	Срок = 0;
	
	Для Каждого ЭлементДерева Из ГруппаЭтапов.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ИдентификаторЭтапа = "Параллельно" Тогда
			РассчитатьСрокПараллельнойГруппыЭтапов(ЭлементДерева);
		ИначеЕсли ЭлементДерева.ИдентификаторЭтапа = "Последовательно" Тогда
			РассчитатьСрокПоследовательнойГруппыЭтапов(ЭлементДерева);
		КонецЕсли;
		Срок = Макс(Срок, ЭлементДерева.СрокВыполненияЧасы);
	КонецЦикла;
	
	ГруппаЭтапов.СрокВыполненияЧасы = Срок;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСрокПоследовательнойГруппыЭтапов(ГруппаЭтапов)
	
	Срок = 0;
	
	Для Каждого ЭлементДерева Из ГруппаЭтапов.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ИдентификаторЭтапа = "Параллельно" Тогда
			РассчитатьСрокПараллельнойГруппыЭтапов(ЭлементДерева);
		ИначеЕсли ЭлементДерева.ИдентификаторЭтапа = "Последовательно" Тогда
			РассчитатьСрокПоследовательнойГруппыЭтапов(ЭлементДерева);
		КонецЕсли;
		Срок = Срок + ЭлементДерева.СрокВыполненияЧасы;
	КонецЦикла;
	
	ГруппаЭтапов.СрокВыполненияЧасы = Срок;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоЭтапов()
	Для Каждого ЭлементДерева Из ДеревоЭтапов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоЭтапов.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполненностьНормативовВДеревеЭтапов(Дерево, Отказ)
	Для Каждого ЭлементДерева Из Дерево.ПолучитьЭлементы() Цикл
		Если ТипЗнч(ЭлементДерева.ИдентификаторЭтапа) = Тип("УникальныйИдентификатор") Тогда
			Если Не ЗначениеЗаполнено(ЭлементДерева.СрокВыполненияЧасы) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для этапа ""%1"" не заполнен норматив'"), ЭлементДерева.ПредставлениеЭтапа);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ДеревоЭтапов", , Отказ);
			КонецЕсли;
		Иначе
			ПроверитьЗаполненностьНормативовВДеревеЭтапов(ЭлементДерева, Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполненностьСрокаВыполнения(Отказ)
	
	СрокНеЗаполнен = Ложь;
	
	Если Объект.СрокВыполненияЧасы = 0 И Объект.СрокВыполненияДни = 0 И Объект.СпособУказанияВремениОкончания = 2 Тогда
		СрокНеЗаполнен = Истина;
	КонецЕсли;
	
	Если Объект.СрокЗависитОтВремениНачала И Объект.СрокВыполненияЧасыПосле = 0
		И Объект.СрокВыполненияДниПосле = 0 И Объект.СпособУказанияВремениОкончанияПосле = 2 Тогда
		СрокНеЗаполнен = Истина;
	КонецЕсли;
	
	Если СрокНеЗаполнен Тогда
		ТекстСообщения = НСтр("ru = 'Срок выполнения не заполнен или заполнен некорректно'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "СрокИнтервалаПредставление", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДеревоЭтаповКорректно()
	
	// Дерево этапов считается корректным, если в нем нет дублей этапов
	
	Этапы = Новый Массив;
	
	СохранитьЭтапыДереваВМассив(Этапы, ДеревоЭтапов);
	
	Возврат ОбщегоназначенияКлиентСервер.СвернутьМассив(Этапы).Количество() = Этапы.Количество();
	
КонецФункции

&НаСервере
Процедура СохранитьЭтапыДереваВМассив(Этапы, Дерево)
	
	Для Каждого ЭлементДерева Из Дерево.ПолучитьЭлементы() Цикл
		Если ТипЗнч(ЭлементДерева.ИдентификаторЭтапа) = Тип("УникальныйИдентификатор") Тогда
			Этапы.Добавить(ЭлементДерева.ИдентификаторЭтапа);
		Иначе
			СохранитьЭтапыДереваВМассив(Этапы, ЭлементДерева);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОВводеВДействие()
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.СтраницыВводВДействие.ТекущаяСтраница = Элементы.НеВведенВДействие;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДействующиеРегламентныеИнтервалы.ИдентификаторНачальногоЭтапа КАК ИдентификаторНачальногоЭтапа
	|ИЗ
	|	РегистрСведений.ДействующиеРегламентныеИнтервалы КАК ДействующиеРегламентныеИнтервалы
	|ГДЕ
	|	ДействующиеРегламентныеИнтервалы.РегламентныйИнтервал = &РегламентныйИнтервал";
	
	Запрос.УстановитьПараметр("РегламентныйИнтервал", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Элементы.СтраницыВводВДействие.ТекущаяСтраница = Элементы.ВведенВДействие;
	Иначе
		Элементы.СтраницыВводВДействие.ТекущаяСтраница = Элементы.НеВведенВДействие;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКэшСроковЭтаповПоДаннымОбъекта()
	
	КэшСроковЭтапов.Очистить();
	
	Для Каждого СтрокаЭтап Из Объект.Этапы Цикл
		ЗаполнитьЗначенияСвойств(КэшСроковЭтапов.Добавить(), СтрокаЭтап);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКэшСрокаЭтапа(ТекущиеДанные)
	
	ЭтапНайден = Ложь;
	
	Для Каждого СтрокаЭтап Из КэшСроковЭтапов Цикл
		Если СтрокаЭтап.ИдентификаторЭтапа = ТекущиеДанные.ИдентификаторЭтапа Тогда
			СтрокаЭтап.СрокВыполненияЧасы = ТекущиеДанные.СрокВыполненияЧасы;
			ЭтапНайден = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЭтапНайден Тогда
		ЗаполнитьЗначенияСвойств(КэшСроковЭтапов.Добавить(), ТекущиеДанные)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
